"""
# 幾何_偏角ソート

## 説明
座標面における点のリストが与えられる。
原点からのそれぞれの偏角をみて、それによってソートを行って返す。

なお与えられる点のリストの中に原点は入っていないものとする。

## 計算量 O(N logN)
※ cmp_to_key は関数呼び出しなので PyPy では遅くなる可能性がある。CPython を試すこと。
## メモリ O(N)

## 使われる問題
ABC442-E https://atcoder.jp/contests/abc442/tasks/abc442_e

## 処理の概要
比較関数 gaiseki を用いて全体をソートする。
ただしこれだけだと「反時計回りに見たとき、どちらが左側（前）に居るか」しかわからないので
0度をまたぐところでどっちがどっちかわからなくなる。
というわけで、0-180度 (Y > 0) と、180-360度 (Y < 0) で分けて
あとからくっつける。より厳密には [0, 180) と [180, 360)

#########################################################
## ライブラリ本体 + 使用例
"""
from functools import cmp_to_key
E = [
    [351656128, 486890400],    [43833334, 189818465],    [244758369, 410609525],
    [82390518, 959687989],    [37964139, 450230904],    [-27725133, 788196612],
    [392638907, -544184247],    [-305242056, -60014958],    [-928747557, 460755669],
    [-415081310, 638281062],    [307908966, -865172261],    [580339611, 459847409],
    [42654321, -744472144],    [-286500328, 34461456],    [-874976232, -245368444],
    [462187336, 508372206],    [-229275227, 74979882],    [-180126519, 740406850],
    [877877433, -211582842],    [256315745, -928285605], [200000000, 0], 
    [0, -200000000], [200000000, 1111111110]]
# 原点 O と点 I, J を結ぶ線分 OI, OJ について
# その偏角が OI < OJ なら正の値を返す。
def gaiseki(I, J):
  Ix, Iy = I[0], I[1]
  Jx, Jy = J[0], J[1]
  return Ix * Jy - Iy * Jx

def argument_sort(E):
  E0, E180 = [], [] # [0, 180) と [180, 360)
  for e in E:
    x, y = e[0], e[1]
    if y == 0 and x > 0:
      E0.append(e)
    elif y == 0 and x < 0:
      E180.append(e)
    elif y > 0:
      E0.append(e)
    elif y < 0:
      E180.append(e)

  ret = []
  E0.sort(key=cmp_to_key(gaiseki), reverse=True)
  E180.sort(key=cmp_to_key(gaiseki), reverse=True)
  for e in E0:
    ret.append(e)
  for e in E180:
    ret.append(e)
  return ret

F = argument_sort(E)
#print(F)

# 出力して確認（atan2 は偏角を求める関数, degreesはラジアンから角度にする関数）
import math
for f in F:
  x, y = f[0], f[1]
  print(x // 10**7, y // 10**7, math.degrees(math.atan2(y, x)) % 360)

"""
# 出力して確認（z は傾きなので偏角と必ずしも一致しない）
INF = 10**20
for f in F:
  x, y = f[0], f[1]
  if x == 0:
    if y > 0:
      z = INF
    if y < 0:
      z = -INF
  else:
    z = f[1] / f[0]
  print(x//10**7, y//10**7, z)
"""