"""
# 幾何_傾きソート

## 説明
幾何_偏角ソートの応用。
あちらは原点を中心とした偏角を扱ったが、
こちらは180度反対側にある、傾きが等しい点も同列に扱う。

なお与えられる点のリストの中に原点は入っていないものとする。

## 計算量 O(N logN)
※ cmp_to_key は関数呼び出しなので PyPy では遅くなる可能性がある。CPython を試すこと。

## メモリ O(N)

## 使われる問題
ABC481-E https://atcoder.jp/contests/abc481/tasks/abc481_e

## 処理の概要
与えられた座標の配列 E を、傾きの小さい順に並び替える。
イメージとしては傾き -INF から、直線を反時計回りに回していって傾きを上げていく。
重なった点をみていって最終的に +INF になるまで続ける。
Y軸と重なる点は別個に扱う。
ここでは傾きを +無限大 とみなす。

比較関数 katamuki を用いて全体をソートする。
その際
Iy   Jy
-- < --
Ix   Jx
が成り立つなら正を返すのだが、両辺に Ix * Jx を掛けて分母を消し
Iy * Jx < Jy * Ix
とする。しかしここには罠があり、Ix * Jx が負の場合は不等号が逆転してしまう。
なので、関数 katamuki の中で場合分けを行う。

外積による偏角ソートでは 0 度という区切りを作るために円を 2 分割したが
今回はその必要はない。

#########################################################
## ライブラリ本体 + 使用例
"""
from functools import cmp_to_key
E = [
    [351656128, 486890400],    [43833334, 189818465],    [244758369, 410609525],
    [82390518, 959687989],    [37964139, 450230904],    [-27725133, 788196612],
    [392638907, -544184247],    [-305242056, -60014958],    [-928747557, 460755669],
    [-415081310, 638281062],    [307908966, -865172261],    [580339611, 459847409],
    [42654321, -744472144],    [-286500328, 34461456],    [-874976232, -245368444],
    [462187336, 508372206],    [-229275227, 74979882],    [-180126519, 740406850],
    [877877433, -211582842],    [256315745, -928285605], [200000000, 0], 
    [0, -200000000], [200000000, 1111111110]]
# 原点 O と点 I, J を結ぶ直線 OI, OJ について
# その傾きが OI < OJ なら正の値を返す。
def katamuki(I, J):
  # x 成分が 0 になる点はここでは扱わないので考慮しなくてよい
  Ix, Iy = I[0], I[1]
  Jx, Jy = J[0], J[1]
  if Ix * Jx > 0:
    return Ix * Jy - Iy * Jx
  elif Ix * Jx < 0: # 分母が負なら不等号が反転するので
    return Iy * Jx - Ix * Jy

def katamuki_sort(E):
  E0, E1 = [], []
  for e in E:
    x, y = e[0], e[1]
    if x == 0:
      E1.append(e)
    else:
      E0.append(e)

  E0.sort(key=cmp_to_key(katamuki), reverse=True)
  for e in E1:
    E0.append(e)
  return E0

F = katamuki_sort(E)
print(F)

# 出力して確認
INF = 10**20
for f in F:
  x, y = f[0], f[1]
  if x == 0 :
    print(0, y // 10**7, INF)
  else:
    print(x // 10**7, y // 10**7, y / x)
