import math
# 四捨五入
# 単に 10000 倍するだけでも誤差が出てしまう。int() だと無条件に切り捨ててしまうので round() を使う。
X = 53092.1162
"""
print(X * 10000) # 530921161.99999994
print(int(X * 10000)) # 530921161
print(round(X * 10000)) # 530921162
"""
X = -92240.4055
"""
print(X * 10000) # -922404054.9999999
print(int(X * 10000)) # -922404054
print(round(X * 10000)) # -922404055
"""
# 小数点同士の足し算も不正確
print(0.1+0.2) # 0.30000000000000004
print(round((0.1+0.2) * 10) / 10)

# 切り捨て
math.floor(123.45) # 123
math.floor(-123.45) # -124
# 切り上げ
math.ceil(123.45) # 124
math.ceil(-123.45) # -123

# A ÷ B の場合は math.ceil よりも // を使うべき
A = 1040302749724122076
B = 23879
"""
print(math.ceil(A / B))  # 43565591093602
print((A + B - 1) // B)  # 43565591093602
print(math.floor(A / B)) # 43565591093602
print(A // B)            # 43565591093601
"""
# 結果が異なるのはこれらが違うのが原因。
print(A / B) # 43565591093602.0   厳密には 43565591093601.99656602 らしい
print(A // B) # 43565591093601

###### 結論
# 切り捨ては // でいい。
# A // B # 43565591093601
123.45 // 1 # 123.0
-123.45 // 1 # -124.0
# 切り上げは切り捨てを利用する。
# (A + B - 1) // B
print((A + B - 1) // B)

####################
# L 以上の最小の 10000 の倍数を探す
L = -19956.241
L2 = L / 10000 # -1.9956241000000001
L3 = math.ceil(L2) # -1
print(L3 * 10000)
print(math.ceil(L / 10000) * 10000) # 1行で書くとこうなる
print(math.ceil(300000.00001 / 10000) * 10000)
print(math.ceil(-300000.000001 / 10000) * 10000)
