
"""
# LIS (Longest Increase Subsequence, 最長増加部分列) について
ある数列が与えられたときにその（連続とは限らない）部分列を抜き出すことを考えます。その部分列のうち、単調増加であるものの中で最も長い数列の一つを求めるアルゴリズムが LIS です。

さて、いろいろと調べたのですが僕にはどういう仕組みなのかうまく理解できなかったので ChatGPT にコードを書いてもらい、それを読みながら考えることにしました。このコードが何をしているのかについて自分なりの理解でなんとか説明してみます。

```python
import bisect
def lis_reconstruct_strict(A):
  n = len(A)
  tails = []          # 長さ i+1 の増加部分列の末尾に置くことができる最小の値を tails[i] に格納
  tails_idx = []      # tails[k] を作った A の添字
  prev_idx = [-1 for _ in range(n)]  # 復元用。A[i] を採用したときにその直前の文字 A[i]（の添字）を格納

  for i, a in enumerate(A):
    k = bisect.bisect_left(tails, a)  # a 以上の最小
    if k == len(tails): # どれよりも大きいやつが来たらそのまま追加
      tails.append(a)
      tails_idx.append(i)
    else: # そうでない場合は k 番目の数をより小さなものに更新する（当然元あった数より x の方が小さいまたは等しい）
      tails[k] = a
      tails_idx[k] = i
    # 直前ポインタを張る。今 A[i] を末尾にする長さ k+1 の増加部分列ができたので、
    # その直前の要素（長さ k の末尾）の添字である tails_idx[k-1] を入れておく。
    if k > 0: # k == 0 のときは先頭なので無視
      prev_idx[i] = tails_idx[k-1]

  # 復元
  ret = []
  i = tails_idx[-1]
  while i != -1:
    ret.append(A[i])
    i = prev_idx[i]
  ret.reverse()
  return ret
```
  
## 概要
このコードで最も大事なのは配列 tails です。このコードではある長さの増加部分列を作るにあたり「その末尾に来る可能性のある値の中で最小になる値とその添字」を長さごとに記録していきます。そのために配列 tails を用意します。tails[i] に長さ i+1 の増加部分列の末尾に来る可能性のある値の中で最小になる値を格納します。同様に tails_idx にはその添字を格納します。

「長さ i+1 の増加部分列の末尾に来る可能性のある値の中で最小になる値」を把握することは「その先もさらに増加部分列を伸ばしていくにあたって最も有利な条件を知る」ことになります。例として長さ 4 の増加部分列について考えているとします。今、

$$ [2, 4, 7, 10] $$

という増加部分列があるとします。次に  8  が来たとします。すると、この増加部分列の 10 を 8 に取り替えた方がその後さらに列を伸ばせる可能性が高くなります。これを繰り返してなるべく長い増加部分列を作ります。今は長さ4の増加部分列についてこのような処理を行いましたが、これをあらゆる長さの増加部分列について判定していきます。ただ、全ての長さの増加部分列を全て保持しておくことはできません。メモリや計算時間がオーバーしてしまいます。ですが、実はそれぞれの長さの増加部分列において「末尾に来る可能性のある最小値」だけを保持しておくだけでも LIS を求めることができます。

なお計算量は最大 O(N logN) です。最大長さ N の二分探索を N 回。

## tails の特徴
この配列には以下の特徴があります。

### 単調増加である
配列 tails は単調増加になります。例えば長さ 3 の部分増加列 [X, Y, Z] があるとします。つまり tails[2] == Z です。部分増加列なので明らかに X < Y < Z です。ここで tails[1] == tails[2] == Z, つまり長さ 2 の部分増加列についてもその末尾に来る最小値が Z になる場合を仮定します。しかし、[X, Y, Z] が作れる以上 [X, Y] という部分増加列を必ず作れますから、Y よりも大きい Z が tails[1] に入ることはありえません。一般化すると、長さ k+1 の増加部分列が存在するとき、その先頭の k 個を取れば長さ k の増加部分列が必ず存在するので常に tails[k-1] < tails[k] ということになります。

### 全ての部分増加列は tails の値を下限とする
定義では tails[i] は長さ i+1 の増加部分列の末尾に来る可能性のある値の中で最小になる値です。つまり、ある部分増加列 B を考えたとき、常に tails[i] <= B[i] です。

[図]

## 処理の流れ
以上 2 つの特徴を利用して次のように tails を更新していきます。数列 A を前から一つずつ見ていきます。ループ内で新たに見る数字を a とします。

* a が  tails  の中のどこの値を更新できるのかを調べる。二分探索を用いることで高速に調べられる。
    * a 以上で最小の値が  tails[k]  に該当するとする。その場合  tails[k] = a  と更新する。
    *  tails[k-1]  以下は既に a より小さいのでわざわざ a に更新する必要がない。
    *  tails[k+1]  以上は末尾の一つ前の値が一つ前の  tails  の値（ tails[x]  に対して  tails[x-1] ）以上であることが確定しているので、a によって更新することはできない。
* a がどの  tails  よりも大きいのなら tails の要素を 1 つ増やし、そこに a を入れる。

[図]

## 復元
最長増加部分列の長さを求めるだけなら配列 tails の大きさを見れば十分です。具体的にその部分列を 1 つ知りたい場合は先のコードでいう  prev_idx  という配列が必要になります。配列  tails  にはそれぞれの長さごとに増加部分列の末尾に入る数が格納されていますが、だからといって  tails[0]  から順に並べていけば最長増加部分列が得られるわけではありません。例えば

> A = [10, 20, 30, 40, 50, 1, 2, 35]

という数列が与えられたとき、最長増加部分列は明らかに  [10, 20, 30, 40, 50]  ですが、 tails  は

*  tails[0] = 1 
*  tails[1] = 2 
*  tails[2] = 30 
*  tails[3] = 35 
*  tails[4] = 50 

となるので一致しません。 tails[4]  が決まった後に他の tails の値が変わってしまっていますね。つまり tails のそれぞれの値は最長増加部分列に含まれるとは限りません。

一方、tails が 1 つ伸びる場合はどうでしょうか。新たに tails[x] を設ける（長さ x+1 の増加部分列を考える）として、そのときは既にある長さ x の増加部分列に新たな数字 a をくっつける形になります。つまり、a の 1 つ前は tails[x-1] （長さ x の増加部分列の末尾になりうる最小値）になります。この関係は確定しているので、ここをポインタで繋ぎます。それが配列 prev_idx です。

同様に tails[k] が更新される場合を考えます。先ほどまでの話から、 tails[k-1] < a <= tails[k] です。これにより tails[k-1] が更新されることはなく、tails[k] を a に更新することができ、長さ k の増加部分列に a をくっつけることで長さ k+1 の増加部分列を新たに作る（というより、既にある長さ k+1 の増加部分列を既にある長さ k の増加部分列に a をくっつけたものに差し替える）ことができます。

というわけで tails は変わっていく可能性がありますが、変わる前に確実なところだけをポインタで繋いでおくわけですね。その際は tails ではなく tails_idx を使って添字同士を繋いでおくようにします。そうしないと同じ値が数列 A に含まれていたときにどれがどれだかわからなくなるので。

### 具体例
> A = [10, 20, 30, 40, 50, 1, 2, 35]
先ほどのこの数列で tails と prev_idx がどうなっているかを確認すると、こうなっています。

> tails = [1, 2, 30, 35, 50]
> prev_idx = [-1, 0, 1, 2, 3, -1, 5, 2]

[図]


このように A の各要素を頂点に見立てたグラフになるわけですね。より正確には、森（木の集合）になります。tails の末尾を起点とし、木の葉から根へと順番に辿っていくことで最長増加部分列を復元することができます。




以下、没

### 具体例
$$ A = [5, 10, 6, 12, 7, 13, 8] $$

これを例にとって説明します。最初は tails = [] です。ここから出発して数列 A を前から 1 つずつ見ていきます。

#### A[1] = 5
とりあえず長さ 1 の増加部分列  [5]  が作れるので tails[0] = 5 を入れます。長さ  i  が  tails[i-1]  に相当します。1つずれます。

#### A[2] = 10
長さ 1 の増加部分列は  [5]  が最良です。長さ 2 の増加部分列は  [5, 10]  が作れますので、tails[1] = 10 を新たに付け加えます。

#### A[3] = 6
長さ 1 は変わりませんし、長さ 3 の増加部分列を作ることはできません。長さ 2 については  [5, 10]  から  [5, 6]  へと更新することで、今後さらに列を伸ばせる可能性が高まります。したがって tails[1] を 10 から 6 へと更新します。

#### A[4] = 12
12はこれまでのどれよりも大きいので、さっきまで作れた中で最大の長さの増加部分列、長さ 2 の  [5, 6]  の後ろに 12 を付け加えることで長さ 3 の増加部分列  [5, 6, 12]  を作ることができます。したがって tails[2] = 12 を新たに付け加えます。

#### A[5] = 7
>  tails = [5, 10, 12] 

今はこんな状態です。ここに 7 がやってきました。この 7 を使って  tails  を更新することを考えましょう。まず  tails[0]  は長さ 1 ですから、5 を 7 に差し替えてしまうと増加部分列が  [5]  から  [7]  になって不利になってしまいますね。

 tails[2]  は 12 を 7 に差し替えて小さくできそうですが、この 12 は長さ 3 の増加部分列の末尾の値です。つまり tails の情報からわかる、現時点で作れる長さ 3 の増加部分列は

>  [X, Y, 12] 

という形になっています。この一つ前の値 Y はどこにも保持されていませんが、少なくとも 10 以上、つまり $ tails[1] \leq Y $ であることはいえます。なぜかというと  [X, Y, 12]  の中から  [X, Y]  を抜き出せば長さ 2 の増加部分列が作れるので、ここでもし$ Y < 10 $ なら $ tails[1] < 10 $ になってしまい矛盾してしまいます。なので  tails[2]  は更新できません。

結局、更新できるのは tails[1] のみです。新たにやってきた数字 7 よりも大きい数字の中で最も小さい数字である 10 を 7 に差し替えることができるので  tails[1] = 7  とします。

以後このような処理を続けます。


### 一般化
先の処理を一般化します。数列 A を前から一つずつ見ていきます。ループ内で新たに見る数字を a とします。

* a が  tails  の中のどこの値を更新できるのかを調べる。二分探索を用いることで高速に調べられる。
    * a 以上で最小の値が  tails[k]  に該当するとする。その場合  tails[k] = a  と更新する。
    *  tails[k-1]  以下は既に a より小さいのでわざわざ a に更新する必要がない。
    *  tails[k+1]  以上は末尾の一つ前の値が一つ前の  tails  の値（ tails[x]  に対して  tails[x-1] ）以上であることが確定しているので、a によって更新することはできない。
* a がどの  tails  よりも大きいのなら tails の要素を 1 つ増やし、そこに a を入れる。


"""

import bisect
def lis_reconstruct_strict(A):
  n = len(A)
  tails = []          # 長さ i+1 の増加部分列の末尾に置くことができる最小の値を tails[i] に格納
  tails_idx = []      # tails[k] を作った A の添字
  prev_idx = [-1 for _ in range(n)]  # 復元用。A[i] を採用したときにその直前の文字 A[i]（の添字）を格納

  for i, a in enumerate(A):
    k = bisect.bisect_left(tails, a)  # a 以上の最小
    if k == len(tails): # どれよりも大きいやつが来たらそのまま追加
      tails.append(a)
      tails_idx.append(i)
    else: # そうでない場合は k 番目の数をより小さなものに更新する（当然元あった数より x の方が小さいまたは等しい）
      tails[k] = a
      tails_idx[k] = i
    # 直前ポインタを張る。今 A[i] を末尾にする長さ k+1 の増加部分列ができたので、
    # その直前の要素（長さ k の末尾）の添字である tails_idx[k-1] を入れておく。
    if k > 0: # k == 0 のときは先頭なので無視
      prev_idx[i] = tails_idx[k-1]

  print(tails)
  print(prev_idx)

  # 復元
  ret = []
  i = tails_idx[-1]
  while i != -1:
    ret.append(A[i])
    i = prev_idx[i]
  ret.reverse()
  return ret

A = [10, 20, 30, 40, 50, 1, 2, 35]
#A = [5, 10, 6, 12, 7, 13, 8]
print(lis_reconstruct_strict(A))

"""
print(lis_reconstruct_strict([1,3,4,5,6]))
print(lis_reconstruct_strict([1,3,4,5,6,2]))
print(lis_reconstruct_strict([10,9,8]))
print(lis_reconstruct_strict([10,9,8, 1, 2, 3, 7, 6, 4, 5]))
"""