"""
# Z-algorithm
## 目的
ある文字列 S に対し、連続部分文字列 S[i:] と S とを見比べて最長共通接頭辞（先頭から何文字が一致しているか）を表す配列 Z[i] を作成すること。

## 高速化の仕組み
愚直に1字ずつ探索すると、最長共通接頭辞の長さの総和 (+|S|) 回だけ比較を行わないといけない。だから最悪の場合計算量が O(|S|^2) になってしまう。
そこで i の昇順に Z[i] を求めていく過程で、過去の Z[i] を再利用してサボれるところはサボるのがこのアルゴリズム。

基本的には1字ずつ探索していき、サボれるところをサボる。たとえば  Z[i] = j すなわち S[:j] と S[i:i+j] が等しいとき、S[1:j] と S[i+1:i+j], S[2:j] と S[i+2:i+j], ..., S[j-1:j] と S[i+j-1:i+j] もそれぞれ等しい。なので Z[i+k] (0 < k < j) に対し、Z[k] の値を再利用できる。

ここで注意すべきなのは i+j より右の文字についてはまだ一致を確認していないので確定できないこと。Z[i+k] = Z[k] の代入をいったんやめて i の値を動かし、再び1字ずつの探索に戻る。この際、先ほど確認したところまでは再度調べる必要がない。つまり尺取法のように、L, R ともに左へと戻す必要がない。だから計算量は O(|S|) で済む。
"""

def z_algorithm(string):
  n = len(string)
  Z = [0 for _ in range(n)]
  Z[0] = n
  i, j = 1, 0 # i は絶対位置、j は i からの相対位置
  while (i < n):
    # 1字つつ進めながら一致をチェック
    while (i + j < n and S[j] == S[i+j]):
      j += 1
    Z[i] = j

    if j == 0:
      i += 1
      continue

    # Z[i] == j より S[:j] == S[i:i+j] すなわち 0 < k < j に対し
    # S[k:j] == S[i+k:i+j] つまり Z[i+k] == Z[k] 
    # ただし、S[i+j] 以降は未チェックなので 
    # Z[k] の値が大きいとき、Z[i+k] の値も同じになるのかは確定できない。
    # その場合はループを打ち切って次の i に投げる。
    k = 1
    while (k < j and k + Z[k] < j):
      Z[i+k] = Z[k]
      k += 1
    i += k # まとめて k 回進んだので反映させる
    j -= k # j は i からの相対位置なので逆に k だけ戻す

  return Z