"""
尺取り法 (Two Pointer Approach)

1 <= L <= N, 1 <= R <= N の範囲で全探索すると L <= R を仮定しても
計算量は N*(N+1)//2, つまり O(N^2)
L = 1 に対し R = 1, 2, 3, .....
L = 2 に対し R = 1, 2, 3, .....

これを
L = 1 に対し R = 1, 2, ..., X
L = 2 に対し R = X, X+1, ....
とすることで計算量を概ね 2*N, つまり O(N) に減らす。

計算量削減のポイントは一度右に進んだ R が左には戻らないということ。
それを成立させるために必要な条件は
「L を固定して R を自由に動かすとき、
ある範囲までは条件がずっと成立し、その範囲を出たら条件が成立しない」
こと。成立／不成立は逆でもよい。
"""

# ABC032-C を題材にする。 0 が含まれる例外的な場合はこのテンプレでは無視する。
"""
N, K = map(int, input().split())
S = [0 for _ in range(N+1)]
for i in range(1, N+1):
  S[i] = int(input())
"""
N, K = 7, 6 # 1-index
A = [0, 4, 3, 1, 1, 2, 10, 2]
print(A)

# 尺取法
# 範囲の表現方法は (L, R)、つまり各 S[i] ではなくその間の仕切り。
# L は 1 - N、R は 1 - N+1 の値をとる（L == N+1 は無意味なので考慮しない）
# たとえば初期値 (1, 1) は空の範囲を指す
ans = 0
R = 1
# [条件判定用変数の初期化]
value = 1 
for L in range(1, N+1): 
  print(f"-- {L=} --")
  # while (R <= N and [Rを用いた条件判定式]):
  while (R <= N and value * A[R] <= K):
    # [R を用いて条件判定用変数の値を変える]
    print(R)
    value *= A[R]
    R += 1

  # [この問題の答えを数える部分]
  ans = max(ans, R - L)

  if L == R:
    R += 1
  else:
    # [L を用いて条件判定用変数の値を変える]
    value //= A[L]
    
print(ans)


##########################################################################

## 尺取り法

# 問題 https://judge.u-aizu.ac.jp/onlinejudge/description.jsp?id=DSL_3_C&lang=jp
# 長さ N の数列 a1,a2,a3,...,aN が与えられます。
# また, 次のような質問が Q 個与えられます。
# i 個目の質問では, 整数 x[i] が与えられます。
# 各質問について, 連続する部分列でその総和が x[i] 以下となるものの個数列を求めて下さい。

# なお N <= 10**5, Q <= 500, 1 <= A[i] <= 10**9 とする。
"""
N, Q = 6, 5
A = [0] + [1,2,3,4,5,6]
X = [0] + [6,9,12,21,15]

N, Q = 6, 1
A = [0] + [5,3,8,6,1,4]
X = [0] + [12]

cum_A = [0 for _ in range(N+1)]
for i in range(1, N+1):
  cum_A[i] = cum_A[i-1] + A[i]
print(cum_A)
for i in range(1, Q+1):
  x = X[i]
  count = 0
  R = 1 # 最初、L も R も左端
  for L in range(1, N+1): # Lを固定し、R を 右へと動かしていく
    # R の開始地点は前回の終了地点
    while (R <= N and 0 <= cum_A[R] - cum_A[L-1] <= x): # 条件（総和が x 以下）を満たさなくなったところで R を止める
      R += 1
    print(f"{L}-{R-1}", f"{R-L}個, " , end=" ") # L 以上 R 未満を加算する
    count += R - L

    # L が R を追い越すようなら、R を L に追いつかせる
    if (R == L):
      R += 1

  print(f"合計 {count} 個")
"""
